renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx64m/r_qspi_smstr_target_dev_port.c
/*******************************************************************************
* Function Name: r_qspi_smstr_dataio2_init
* Description  : Initializes setting of port for QIO2.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio2_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QIO2 ---- */
            QSPI_CH0_ODR_DATAIO2    = 0;              /* Output type is CMOS output.              */
            QSPI_CH0_PCR_DATAIO2    = 0;              /* Disable input pull-up resistor.          */
    #if (('8' != R_QSPI_SMSTR_CFG_QSPI_QIO2_PORT) && ('0' != R_QSPI_SMSTR_CFG_QSPI_QIO2_BIT))
            QSPI_CH0_DSCR_DATAIO2   = 1;              /* Drive capacity is High-drive output.     */
    #endif
            QSPI_CH0_PDR_DATAIO2    = QSPI_SMSTR_IN;  /* Select input direction.                  */
            if (QSPI_SMSTR_IN == QSPI_CH0_PDR_DATAIO2)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio2_reset
* Description  : Resets setting of port for QIO2.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio2_reset(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QIO2 ---- */
            QSPI_CH0_PDR_DATAIO2    = QSPI_SMSTR_IN;  /* Select input direction.                  */
    #if (('8' != R_QSPI_SMSTR_CFG_QSPI_QIO2_PORT) && ('0' != R_QSPI_SMSTR_CFG_QSPI_QIO2_BIT))
            QSPI_CH0_DSCR_DATAIO2   = 0;              /* Drive capacity is normal drive output.   */
    #endif
            QSPI_CH0_PCR_DATAIO2    = 0;              /* Disable input pull-up resistor.          */
            QSPI_CH0_ODR_DATAIO2    = 0;              /* Output type is CMOS output.              */
            if (0 == QSPI_CH0_ODR_DATAIO2)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio3_init
* Description  : Initializes setting of port for QIO3.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio3_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QIO3 ---- */
            QSPI_CH0_ODR_DATAIO3    = 0;              /* Output type is CMOS output.              */
            QSPI_CH0_PCR_DATAIO3    = 0;              /* Disable input pull-up resistor.          */
    #if (('8' != R_QSPI_SMSTR_CFG_QSPI_QIO3_PORT) && ('1' != R_QSPI_SMSTR_CFG_QSPI_QIO3_BIT))
            QSPI_CH0_DSCR_DATAIO3   = 1;              /* Drive capacity is High-drive output.     */
    #endif
            QSPI_CH0_PDR_DATAIO3    = QSPI_SMSTR_IN;  /* Select input direction.                  */
            if (QSPI_SMSTR_IN == QSPI_CH0_PDR_DATAIO3)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_dataio3_reset
* Description  : Resets setting of port for QIO3.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_dataio3_reset(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QIO3 ---- */
            QSPI_CH0_PDR_DATAIO3    = QSPI_SMSTR_IN;  /* Select input direction.                  */
    #if (('8' != R_QSPI_SMSTR_CFG_QSPI_QIO3_PORT) && ('1' != R_QSPI_SMSTR_CFG_QSPI_QIO3_BIT))
            QSPI_CH0_DSCR_DATAIO3   = 0;              /* Drive capacity is normal drive output.   */
    #endif
            QSPI_CH0_PCR_DATAIO3    = 0;              /* Disable input pull-up resistor.          */
            QSPI_CH0_ODR_DATAIO3    = 0;              /* Output type is CMOS output.              */
            if (0 == QSPI_CH0_ODR_DATAIO3)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_clk_init
* Description  : Initializes setting of port for QSPCLK.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_clk_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            /* ---- Setting of port for QSPCLK ---- */
            QSPI_CH0_ODR_CLK    = 0;                /* Output type is CMOS output.              */
    #if (('7' != R_QSPI_SMSTR_CFG_QSPI_QSPCLK_PORT) && ('7' != R_QSPI_SMSTR_CFG_QSPI_QSPCLK_BIT))
            QSPI_CH0_DSCR_CLK   = 1;                /* Drive capacity is High-drive output.     */
    #endif
            QSPI_CH0_PODR_CLK   = QSPI_SMSTR_HI;    /* Output data is High.                     */
            QSPI_CH0_PDR_CLK    = QSPI_SMSTR_OUT;   /* Select output direction.                 */
            if (QSPI_SMSTR_OUT == QSPI_CH0_PDR_CLK)
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


