renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx64m/r_qspi_smstr_target_dev_port.c
    /* ---- Check DMAC/DTC transfer end.  --- */
    /* Timeout value depends on transfer size. 
       Minimum time is 100ms. When the data count exceeds 10 sectors (1 sector = 512 bytes),
       increase 10ms time for 1 sector increase.*/
    if ((QSPI_SECTOR_SIZE * 11) <= size)
    {
        time = (time + (((size / QSPI_SECTOR_SIZE) - 10) * 10));
        if (0x0fffffff < time)
        {
            time = 0x0fffffff;
        }
    }

    /* Start timer. */
    r_qspi_smstr_start_timer(channel, time);

    /* WAIT_LOOP */
    while (1)
    {
        /* Check timeout. */
        if (QSPI_SMSTR_ERR_HARD == r_qspi_smstr_check_timer(channel))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR_TARGET_DEV_PORT, __LINE__);
            ret = QSPI_SMSTR_ERR_HARD;
            break;
        }
        
        /* Check DMAC/DTC transfer end */
        if (QSPI_SET_TRANS_STOP == gs_qspi_int_spti_dmacdtc_flg[channel])
        {
            break;
        }
    }

    r_qspi_smstr_end_timer(channel);

    return ret;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_rx_dmacdtc_wait
* Description  : Waits for reception completion.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_rx_dmacdtc_wait(uint8_t channel, uint32_t size)
{
    qspi_smstr_status_t    ret  = QSPI_SMSTR_SUCCESS;
    uint32_t               time = QSPI_TIMER_MIN_TIME;     /* 100ms        */

    /* ---- Check DMAC/DTC transfer end.  --- */
    /* Timeout value depends on transfer size. 
       Minimum time is 100ms. When the data count exceeds 10 sectors (1 sector = 512 bytes),
       increase 10ms time for 1 sector increase.*/
    if ((QSPI_SECTOR_SIZE * 11) <= size)
    {
        time = (time + (((size / QSPI_SECTOR_SIZE) - 10) * 10));
        if (0x0fffffff < time)
        {
            time = 0x0fffffff;
        }
    }

    /* Start timer. */
    r_qspi_smstr_start_timer(channel, time);

    /* WAIT_LOOP */
    while (1)
    {
        /* Check timeout. */
        if (QSPI_SMSTR_ERR_HARD == r_qspi_smstr_check_timer(channel))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR_TARGET_DEV_PORT, __LINE__);
            ret = QSPI_SMSTR_ERR_HARD;
            break;
        }
        
        /* Check DMAC/DTC transfer end */
        if (QSPI_SET_TRANS_STOP == gs_qspi_int_spri_dmacdtc_flg[channel])
        {
            break;
        }
    }

    r_qspi_smstr_end_timer(channel);

    return ret;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_int_spti_init
* Description  : Initializes the interrupt registers of SPTI.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_int_spti_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            R_BSP_InterruptRequestDisable(VECT(QSPI, SPTI));
            IR(QSPI, SPTI)    = 0;
            IPR(QSPI, SPTI)   = QSPI_SMSTR_CFG_CH0_INT_SPTI_LEVEL;
            if (0 == IPR(QSPI, SPTI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH0_INCLUDED) */
        break;
        
        case 1:
#if defined(QSPI_SMSTR_CFG_CH1_INCLUDED)
            R_BSP_InterruptRequestDisable(VECT(QSPI, SPTI));
            IR(QSPI, SPTI)    = 0;
            IPR(QSPI, SPTI)   = QSPI_SMSTR_CFG_CH1_INT_SPTI_LEVEL;
            if (0 == IPR(QSPI, SPTI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH1_INCLUDED) */
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_int_spti_init
* Description  : Initializes the interrupt registers of SPTI.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_int_spri_init(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            R_BSP_InterruptRequestDisable(VECT(QSPI, SPRI));
            IR(QSPI, SPRI)    = 0;
            IPR(QSPI, SPRI)   = QSPI_SMSTR_CFG_CH0_INT_SPRI_LEVEL;
            if (0 == IPR(QSPI, SPRI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH0_INCLUDED) */
        break;
        
        case 1:
#if defined(QSPI_SMSTR_CFG_CH1_INCLUDED)
            R_BSP_InterruptRequestDisable(VECT(QSPI, SPRI));
            IR(QSPI, SPTR)    = 0;
            IPR(QSPI, SPRI)   = QSPI_SMSTR_CFG_CH1_INT_SPRI_LEVEL;
            if (0 == IPR(QSPI, SPRI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH1_INCLUDED) */
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_int_spti_ier_set
* Description  : Sets the ICU.IERm.IENj bit of SPTI to 1.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_int_spti_ier_set(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            R_BSP_InterruptRequestEnable(VECT(QSPI, SPTI));                /* Enable QSPI0.SPTI0 interrupt request.    */
            if (1 == IEN(QSPI, SPTI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH0_INCLUDED) */
        break;
        
        case 1:
#if defined(QSPI_SMSTR_CFG_CH1_INCLUDED)
            R_BSP_InterruptRequestEnable(VECT(QSPI, SPTI));                /* Enable QSPI1.SPTI1 interrupt request.    */
            if (1 == IEN(QSPI, SPTI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH1_INCLUDED) */
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


