renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx64m/r_qspi_smstr_target_dev_port.c
/*******************************************************************************
* Function Name: r_qspi_smstr_int_spri_ier_set
* Description  : Sets the ICU.IERm.IENj bit of SPRI to 1.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_int_spri_ier_set(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            R_BSP_InterruptRequestEnable(VECT(QSPI, SPRI));                /* Enable QSPI0.SPRI0 interrupt request.    */
            if (1 == IEN(QSPI, SPRI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH0_INCLUDED) */
        break;
        
        case 1:
#if defined(QSPI_SMSTR_CFG_CH1_INCLUDED)
            R_BSP_InterruptRequestEnable(VECT(QSPI, SPRI));                /* Enable QSPI1.SPRI1 interrupt request.    */
            if (1 == IEN(QSPI, SPRI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH1_INCLUDED) */
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Int_Spti_Ier_Clear
 *****************************************************************************************************************/ /**
 * @brief This function is used to clear the ICU.IERm.IENj bit of the transmit buffer-empty interrupt (SPTI).
 * @param[in] channel
 *             QSPI channel number
 * @details   Use this function when disabling interrupts from within the handler of the SPTI interrupt generated at 
 *            DMAC transfer-end. \n
 * @note      Do not use this function for software transfers or DTC transfers. Doing so could disrupt the transfer.
 */
void R_QSPI_SMstr_Int_Spti_Ier_Clear(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            R_BSP_InterruptRequestDisable(VECT(QSPI, SPTI));                /* Disable QSPI0.SPTI0 interrupt request.   */
            IR(QSPI,SPTI)     = 0;                /* Clear QSPI0.SPTI0 interrupt status flag. */
            if (0 == IR(QSPI, SPTI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH0_INCLUDED) */
        break;
        
        case 1:
#if defined(QSPI_SMSTR_CFG_CH1_INCLUDED)
            R_BSP_InterruptRequestDisable(VECT(QSPI, SPTI));                /* Disable QSPI1.SPTI1 interrupt request.   */
            IR(QSPI,SPTI)     = 0;                /* Clear QSPI1.SPTI1 interrupt status flag. */
            if (0 == IR(QSPI, SPTI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH1_INCLUDED) */
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Int_Spri_Ier_Clear
 *****************************************************************************************************************/ /**
 * @brief This function is used to clear the ICU.IERm.IENj bit of the receive buffer-full interrupt (SPRI).
 * @param[in] channel
 *             QSPI channel number
 * @details   Use this function when disabling interrupts from within the handler of the SPRI interrupt generated at 
 *            DMAC transfer-end. \n
 * @note      Do not use this function for software transfers or DTC transfers. Doing so could disrupt the transfer.
 */
void R_QSPI_SMstr_Int_Spri_Ier_Clear(uint8_t channel)
{
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
            R_BSP_InterruptRequestDisable(VECT(QSPI, SPRI));                /* Disable QSPI0.SPRI0 interrupt request.   */
            IR(QSPI,SPRI)     = 0;                /* Clear QSPI0.SPRI0 interrupt status flag. */
            if (0 == IR(QSPI, SPRI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH0_INCLUDED) */
        break;
        
        case 1:
#if defined(QSPI_SMSTR_CFG_CH1_INCLUDED)
            R_BSP_InterruptRequestDisable(VECT(QSPI, SPRI));                /* Disable QSPI1.SPRI1 interrupt request.   */
            IR(QSPI,SPRI)     = 0;                /* Clear QSPI1.SPRI1 interrupt status flag. */
            if (0 == IR(QSPI, SPRI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif  /* defined(QSPI_SMSTR_CFG_CH1_INCLUDED) */
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
}


/**********************************************************************************************************************
 * Function Name: R_QSPI_SMstr_Int_Spti_Dmacdtc_flag_Set
 *****************************************************************************************************************/ /**
 * @brief This function is used to set the DMAC or DTC transfer-end flag for data transmission.
 * @param[in] channel
 *             QSPI channel number
 * @param[in] flg
 *             Flag. The settings are as follows.\n
 *             QSPI_SET_TRANS_STOP : DMAC or DTC transfer-end\n
 *             (QSPI_SET_TRANS_START : DMAC or DTC transfer-start: Setting by the user is prohibited.)
 * @retval    QSPI_SMSTR_SUCCESS     Successful operation
 * @retval    QSPI_SMSTR_ERR_PARAM   Parameter error
 * @details   Set QSPI_SET_TRANS_STOP from within the handler of the SPTI interrupt generated at DMAC transfer-end.
 * @note      Do not use this function for software transfers or DTC transfers. Doing so could disrupt the transfer.
 */
qspi_smstr_status_t R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(uint8_t channel, qspi_smstr_trans_flg_t flg)
{
    if ((QSPI_SET_TRANS_STOP != flg) && (QSPI_SET_TRANS_START != flg))
    {
        return QSPI_SMSTR_ERR_PARAM;
    }
    
    gs_qspi_int_spti_dmacdtc_flg[channel] = flg;
    
